
#Область ОбработчикиСобытийФормы

&НаСервере
&После("ПриСозданииНаСервере")
Процедура прем_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	прем_ДобавитьКнопкуСформироватьЭтапыПроизводстваБиблиотека();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийКомандФормы

&НаКлиенте
Процедура прем_СформироватьЭтапыПроизводства(Команда)
	
	// NOP
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура прем_ДобавитьКнопкуСформироватьЭтапыПроизводстваВручную()
	
	ИмяКнопки = "прем_СформироватьЭтапыПроизводства";
	ЗаголовокКнопки = НСтр("ru='Сформировать этапы производства'");
	
	// Команда
	КомандаСформироватьЭтапыПроизводства = Команды.Добавить(ИмяКнопки);
	КомандаСформироватьЭтапыПроизводства.Действие = ИмяКнопки;
	КомандаСформироватьЭтапыПроизводства.Заголовок = ЗаголовокКнопки;
	
	// Кнопка
	КнопкаСформироватьЭтапыПроизводства = Элементы.Добавить(
		ИмяКнопки,
		Тип("КнопкаФормы"),
		Элементы.ТоварыГруппаЗаполнить);
		
	КнопкаСформироватьЭтапыПроизводства.Заголовок = ЗаголовокКнопки;
	КнопкаСформироватьЭтапыПроизводства.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	КнопкаСформироватьЭтапыПроизводства.ИмяКоманды = ИмяКнопки;
	
КонецПроцедуры

Процедура прем_ДобавитьКнопкуСформироватьЭтапыПроизводстваБиблиотека()
	
	ИмяКнопки = "прем_СформироватьЭтапыПроизводства";
	ЗаголовокКнопки = НСтр("ru='Сформировать этапы производства'");
	
	КнопкаСформироватьЭтапыПроизводства = прем_МодификацияИнтерфейсовСервер.ДобавитьКнопкуНаФорму(
		ЭтаФорма,
		ИмяКнопки,
		ЗаголовокКнопки,
		Элементы.ТоварыГруппаЗаполнить);
	
КонецПроцедуры

#КонецОбласти


